#Проверить истинность высказывания: "Среди трех данных целых чисел есть хотя бы одна пара взаимно противоположных"
while True:
    try:
        a = int(input("Введите первое число: "))
        b = int(input("Введите второе число: "))
        c = int(input("Введите третье число: "))
        break
    except ValueError:
        print("Ошибка! Введите целые числа. ")

# Проверка на наличие противоположных пар
if (a == -b) or (a == -c) or (b == -c):
    print("Истинно: есть пара противоположных чисел")
else:
    print("Ложно: противоположных пар нет")



